<a href="https://colab.research.google.com/github/FRANMUMADE/ENTREGAS_FCOTREJO_MUMADE_2022/blob/main/09_nov_Consultas_SQL_FRAN_PARA_ENTREGAR.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

ALUMNO: FRANCISCO JAVIER TREJO RODRÍGUEZ

# Consultas SQL
FINANCIAL DATA SET
Disculpad por la posible falta de tildes o uso indebido de mayúsculas.
---


Antes de empezar cargamos nuestro archivo data_berka en nuestro entorno: [enlace](https://sorry.vse.cz/~berka/challenge/pkdd1999/berka.htm)

In [ ]:
!gdown --id 1Osmr7qVN0NMuqYxvLesNn7H4nqPCVbsU

/usr/local/lib/python3.7/dist-packages/gdown/cli.py:131: FutureWarning: Option `--id` was deprecated in version 4.3.1 and will be removed in 5.0. You don't need to pass it anymore to use a file ID.
  category=FutureWarning,
Downloading...
From: https://drive.google.com/uc?id=1Osmr7qVN0NMuqYxvLesNn7H4nqPCVbsU
To: /content/data_berka.db
100% 70.2M/70.2M [00:00<00:00, 135MB/s]

En primer lugar cargamos la extensión que nos va permitir manejar comandos sql directamente en colab, es parecido al commit que hemos hecho antes

In [ ]:
%load_ext sql

Y conectamos con la base de datos. Al inicio de TODAS las celdas de código debe llevar  %sql de esta forma le decimos que aplique funciones SQL.

In [ ]:
%sql sqlite:///data_berka.db

'Connected: @data_berka.db'

Comprobamos esquema. Siempre tener el diseño abierto y la descripción de los datos, como buena pauta para practicar.
Select: columna/as que queremos de una o varias tablas de BDR.
From: de qué tabla queremos que lo coja.
Where: es condición o filtro que tienen que cumplir los registros que yo quiero para que me salga.

la leyenda sería selecciona la columna name del conjunto sqlite master donde los tipos sean tablas. Muestra cada una de las tablas de nuestra BDR.

In [ ]:
%%sql
SELECT name,type
FROM sqlite_master
WHERE type = 'table'

 * sqlite:///data_berka.db
Done.

[('DISTRICT', 'table'),
 ('ACCOUNT', 'table'),
 ('TRANS', 'table'),
 ('CLIENT', 'table'),
 ('DISPOSITION', 'table'),
 ('CREDIT_CARD', 'table'),
 ('LOAN', 'table'),
 ('PERMANENT_ORDER', 'table')]

## Consultas sobre Préstamos

1. Obtener TODOS (*) los atributos que tienen la tabla Préstamos (LOAN) con un máximo de 20 registros (esto último lo hacemos para que no nos salgan todos las filas o tuplas de dicha tabla.
(extra limitar a 20 registros; comando LIMIT)

In [ ]:
%%sql
SELECT *
FROM LOAN
LIMIT 20

 * sqlite:///data_berka.db
Done.

[(5314, 1787, 930705, 96396, 12, 8033, 'B'),
 (5316, 1801, 930711, 165960, 36, 4610, 'A'),
 (6863, 9188, 930728, 127080, 60, 2118, 'A'),
 (5325, 1843, 930803, 105804, 36, 2939, 'A'),
 (7240, 11013, 930906, 274740, 60, 4579, 'A'),
 (6687, 8261, 930913, 87840, 24, 3660, 'A'),
 (7284, 11265, 930915, 52788, 12, 4399, 'A'),
 (6111, 5428, 930924, 174744, 24, 7281, 'B'),
 (7235, 10973, 931013, 154416, 48, 3217, 'A'),
 (5997, 4894, 931104, 117024, 24, 4876, 'A'),
 (7121, 10364, 931110, 21924, 36, 609, 'A'),
 (6077, 5270, 931122, 79608, 24, 3317, 'A'),
 (6228, 6034, 931201, 464520, 60, 7742, 'B'),
 (6356, 6701, 931208, 95400, 36, 2650, 'A'),
 (5523, 2705, 931208, 93888, 36, 2608, 'A'),
 (6456, 7123, 931209, 47016, 12, 3918, 'A'),
 (7104, 10320, 931213, 259740, 60, 4329, 'A'),
 (6820, 9034, 931216, 38148, 12, 3179, 'A'),
 (6876, 9236, 931221, 86616, 12, 7218, 'A'),
 (7097, 10266, 931223, 75624, 24, 3151, 'B')]

2. Obtener los campos de fecha (date), amount (cantidad), duración (duration), pagos (payments), estado (STATUS)
(extra limitar a 20 registros). Se pone el comando DESC para ordenarlos de forma descendente, ya que tiene predefinido forma ascendente. 
De esta forma solo estamos llamando a ciertas columnas de la tabla préstamos.
Comando ORDER BY

In [ ]:
%%sql
SELECT date, amount, duration, payments, status
FROM LOAN
ORDER BY amount DESC
LIMIT 20

 * sqlite:///data_berka.db
Done.

[(971019, 590820, 60, 9847, 'C'),
 (980123, 566640, 60, 9444, 'C'),
 (971112, 541200, 60, 9020, 'D'),
 (950217, 538500, 60, 8975, 'C'),
 (980120, 504000, 60, 8400, 'C'),
 (980522, 495180, 60, 8253, 'C'),
 (941219, 482940, 60, 8049, 'D'),
 (970212, 475680, 48, 9910, 'C'),
 (970907, 473280, 60, 7888, 'D'),
 (971225, 468060, 60, 7801, 'C'),
 (970613, 466608, 48, 9721, 'C'),
 (971227, 465504, 48, 9698, 'D'),
 (950709, 465072, 48, 9689, 'C'),
 (931201, 464520, 60, 7742, 'B'),
 (971105, 460980, 60, 7683, 'D'),
 (960723, 444864, 48, 9268, 'C'),
 (980829, 437460, 60, 7291, 'C'),
 (980213, 428784, 48, 8933, 'C'),
 (961118, 421008, 48, 8771, 'C'),
 (951029, 419880, 60, 6998, 'C')]

3. Obtener los distintos tipos de estado que se presentan en un préstamo. Me dice los valores que hay en dicho campo. Se refiere a que distinga la variable categórica Status por su clasificación A, B, C o D.
Vemos que al no poner nada lo hace de forma ascendente (teniendo en cuenta el orden alfabético).
comando DISTINCT

In [ ]:
%%sql
SELECT DISTINCT status
FROM LOAN 
ORDER BY status

 * sqlite:///data_berka.db
Done.

[('A',), ('B',), ('C',), ('D',)]

4. Obtener solo los prestamos ya terminados.
De nuestro diccionario de la BDR sacamos que la tabla préstamos, tiene un atributo denominado status, donde sus clasficadores son A, B, D y D, siendo A y B los que están finalizados.

In [ ]:
%%sql
SELECT *
FROM LOAN
WHERE status in ("A", "B")
LIMIT 20

 * sqlite:///data_berka.db
Done.

[(5314, 1787, 930705, 96396, 12, 8033, 'B'),
 (5316, 1801, 930711, 165960, 36, 4610, 'A'),
 (6863, 9188, 930728, 127080, 60, 2118, 'A'),
 (5325, 1843, 930803, 105804, 36, 2939, 'A'),
 (7240, 11013, 930906, 274740, 60, 4579, 'A'),
 (6687, 8261, 930913, 87840, 24, 3660, 'A'),
 (7284, 11265, 930915, 52788, 12, 4399, 'A'),
 (6111, 5428, 930924, 174744, 24, 7281, 'B'),
 (7235, 10973, 931013, 154416, 48, 3217, 'A'),
 (5997, 4894, 931104, 117024, 24, 4876, 'A'),
 (7121, 10364, 931110, 21924, 36, 609, 'A'),
 (6077, 5270, 931122, 79608, 24, 3317, 'A'),
 (6228, 6034, 931201, 464520, 60, 7742, 'B'),
 (6356, 6701, 931208, 95400, 36, 2650, 'A'),
 (5523, 2705, 931208, 93888, 36, 2608, 'A'),
 (6456, 7123, 931209, 47016, 12, 3918, 'A'),
 (7104, 10320, 931213, 259740, 60, 4329, 'A'),
 (6820, 9034, 931216, 38148, 12, 3179, 'A'),
 (6876, 9236, 931221, 86616, 12, 7218, 'A'),
 (7097, 10266, 931223, 75624, 24, 3151, 'B')]

5. Ordenar lo anterior por duración y cantidad

extra: limitar a 40 elementos
Ahora a la misma consulta de antes, le añadimos un nuevo filtro para que el output nos lo devuelva ordenado de forma ascendente según los atributos duración y cantidad del préstamo.

In [ ]:
%%sql
SELECT *
FROM LOAN
WHERE status in ("A", "B")
ORDER BY duration, amount
LIMIT 40

 * sqlite:///data_berka.db
Done.

[(5657, 3354, 940705, 4980, 12, 415, 'A'),
 (6019, 5033, 960725, 11400, 12, 950, 'A'),
 (5103, 666, 971128, 12540, 12, 1045, 'A'),
 (5718, 3637, 970901, 14028, 12, 1169, 'A'),
 (6064, 5215, 940804, 14628, 12, 1219, 'A'),
 (5599, 3064, 950321, 15420, 12, 1285, 'A'),
 (6377, 6792, 970317, 17184, 12, 1432, 'A'),
 (6297, 6363, 941025, 17508, 12, 1459, 'A'),
 (6942, 9513, 970716, 18324, 12, 1527, 'A'),
 (5740, 3752, 950402, 18564, 12, 1547, 'A'),
 (5651, 3329, 971208, 19248, 12, 1604, 'A'),
 (5922, 4580, 950805, 20220, 12, 1685, 'A'),
 (5980, 4825, 950818, 21396, 12, 1783, 'A'),
 (5754, 3834, 940928, 23052, 12, 1921, 'A'),
 (6878, 9242, 970124, 23184, 12, 1932, 'A'),
 (5229, 1329, 970906, 23520, 12, 1960, 'A'),
 (5723, 3674, 940910, 23628, 12, 1969, 'A'),
 (5130, 813, 940511, 24312, 12, 2026, 'A'),
 (5479, 2486, 940110, 24516, 12, 2043, 'A'),
 (5005, 176, 970410, 27456, 12, 2288, 'A'),
 (6578, 7765, 951211, 27984, 12, 2332, 'A'),
 (6865, 9199, 960911, 29448, 12, 2454, 'B'),
 (6501, 7418, 960429, 30276, 12, 2523, 'B'),
 (4961, 19, 960429, 30276, 12, 2523, 'B'),
 (6502, 7424, 971208, 30276, 12, 2523, 'A'),
 (4962, 25, 971208, 30276, 12, 2523, 'A'),
 (5576, 2962, 941221, 31248, 12, 2604, 'A'),
 (6758, 8742, 970729, 33144, 12, 2762, 'A'),
 (5932, 4626, 970618, 33348, 12, 2779, 'A'),
 (6310, 6440, 970617, 34572, 12, 2881, 'A'),
 (7008, 9897, 950922, 36168, 12, 3014, 'A'),
 (6929, 9472, 950508, 36396, 12, 3033, 'A'),
 (6306, 6425, 941220, 36684, 12, 3057, 'A'),
 (6362, 6738, 951031, 37908, 12, 3159, 'A'),
 (6820, 9034, 931216, 38148, 12, 3179, 'A'),
 (5358, 2018, 970121, 38520, 12, 3210, 'A'),
 (5634, 3229, 970501, 39024, 12, 3252, 'A'),
 (6888, 9265, 940711, 39576, 12, 3298, 'A'),
 (6887, 9263, 970508, 39576, 12, 3298, 'A'),
 (6895, 9307, 940919, 41904, 12, 3492, 'A')]

6. Cargar el resultado anterior en un dataframe (objeto) de PANDAS. 
PANDAS es una herramienta de análisis de datos de código abierto en el lenguaje de programación Python. El beneficio de pandas comienza cuando ya se tiene el conjunto de datos principal, generalmente a partir de una consulta SQL.

La primera parte del código es para la importación y la segunda parte es para transformar en dataframe de pandas y guardarlo a parte para trabajar con ello con código SQL (como cuando lo hacemos en R y se queda en el Environment)

In [ ]:
import pandas as pd
df = %sql SELECT * FROM LOAN WHERE status in ("A", "B") ORDER BY duration, amount DESC
df.DataFrame().to_csv("first_sql.csv")

 * sqlite:///data_berka.db
Done.

Ex. 1

>Plantear otro filtro para los préstamos (por cantidad, duración, status, etc.)
Realmente no filtramos porque hemos cogido todas las variables de la tabla préstamos, que si hayan finalizado (eso si es un filtro) y que los ordene de forma ascendente por duración, cantidad y status con un límite de 15 observaciones.

In [ ]:
%%sql
SELECT *
FROM LOAN
WHERE status in ("A", "B")
ORDER BY duration, amount, status
LIMIT 15

 * sqlite:///data_berka.db
Done.

[(5657, 3354, 940705, 4980, 12, 415, 'A'),
 (6019, 5033, 960725, 11400, 12, 950, 'A'),
 (5103, 666, 971128, 12540, 12, 1045, 'A'),
 (5718, 3637, 970901, 14028, 12, 1169, 'A'),
 (6064, 5215, 940804, 14628, 12, 1219, 'A'),
 (5599, 3064, 950321, 15420, 12, 1285, 'A'),
 (6377, 6792, 970317, 17184, 12, 1432, 'A'),
 (6297, 6363, 941025, 17508, 12, 1459, 'A'),
 (6942, 9513, 970716, 18324, 12, 1527, 'A'),
 (5740, 3752, 950402, 18564, 12, 1547, 'A'),
 (5651, 3329, 971208, 19248, 12, 1604, 'A'),
 (5922, 4580, 950805, 20220, 12, 1685, 'A'),
 (5980, 4825, 950818, 21396, 12, 1783, 'A'),
 (5754, 3834, 940928, 23052, 12, 1921, 'A'),
 (6878, 9242, 970124, 23184, 12, 1932, 'A')]

 Ex. 2 

> Seleccionar fecha, cantidad, duración y pagos de aquellos préstamos que han sido terminados ordenados de mayor de 12 meses ordenados de mayor a menor cantidad de dinero.

In [ ]:
%%sql
SELECT date, amount, duration, payments
FROM LOAN
WHERE status in ("A", "B") 
AND duration > 12
ORDER BY amount DESC

>extra: volcar en un DataFrame.
Le llamo second y compruebo en archivos que están ambos creados (first y second)

si lo cliqueo aparace en la derecha
le digo que sea un archivo tipo csv

In [ ]:
import pandas as pd
ds = %sql SELECT date, amount, duration, payments FROM LOAN WHERE status in ("A", "B") AND duration > 12 ORDER BY amount DESC
ds.DataFrame().to_csv("second_sql.csv")

 * sqlite:///data_berka.db
Done.

7. Es posible contabilizar cuántos cumplen dicha condición con el operador COUNT. Es un operador que se incluye junto a SELECT. Le digo que me contabilice todas las observaciones donde la tabla préstamos su estatus sea de prestamo finalizado y su duración mayor a doce meses.

In [ ]:
%%sql
SELECT count (*)
FROM LOAN
WHERE status in ("A", "B") AND duration > 12

 * sqlite:///data_berka.db
Done.

[(131,)]

Ahora puedo saber también cuántos prestamos están en vigor (según diccionario C y D de status).

In [ ]:
%%sql
SELECT count (*)
FROM LOAN
WHERE status in ("C", "D")

 * sqlite:///data_berka.db
Done.

[(448,)]

¿cuantos prestamos hay en ejecución (running) con duración entre 24 y 48 meses

In [ ]:
%%sql
SELECT count(*)
FROM LOAN
WHERE status in ("C", "D") and duration between 24 and 48

 * sqlite:///data_berka.db
Done.

[(279,)]

Podría haber utilizado operadores relacionales como mayor o igual y menor que, etc.
De esta forma nos garantizamos que tenga en cuenta el 24 y el 48 mes.

In [ ]:
%%sql
SELECT count(*)
FROM LOAN
WHERE status in ("C", "D") and duration >= 24 and duration <= 48

 * sqlite:///data_berka.db
Done.

[(279,)]

## Group By
Combinamos registros con valores idénticos para la lista de campos en un grupo.

8. ¿Cuántos préstamos hay por cada estado y cual es la media de la cantidad de dinero prestado?
en el select y en group by debe de estar el campo que quiero seleccionar

primero vemos cuántos préstamos hay en cada uno de las categorías de status.

In [ ]:
%%sql
SELECT status, count(*) 
FROM LOAN
GROUP BY status

 * sqlite:///data_berka.db
Done.

[('A', 203), ('B', 31), ('C', 403), ('D', 45)]

le impongo cierto orden lógico descendente en cuanto a la cuantía NO respecto a la categorización.

In [ ]:
%%sql
SELECT status, count(*) as total
FROM LOAN
GROUP BY status
ORDER BY total DESC

 * sqlite:///data_berka.db
Done.

[('C', 403), ('A', 203), ('D', 45), ('B', 31)]

Añado duración y que lo contabilice en orden descendente.

In [ ]:
%%sql
SELECT status, duration, count(*) as total
FROM LOAN
GROUP BY status, duration
ORDER BY total DESC

 * sqlite:///data_berka.db
Done.

[('C', 60, 125),
 ('C', 48, 111),
 ('A', 12, 93),
 ('C', 36, 83),
 ('A', 24, 64),
 ('C', 24, 57),
 ('A', 36, 32),
 ('C', 12, 27),
 ('D', 60, 16),
 ('D', 48, 14),
 ('A', 48, 11),
 ('B', 24, 11),
 ('B', 12, 10),
 ('D', 36, 8),
 ('B', 36, 7),
 ('D', 24, 6),
 ('A', 60, 3),
 ('B', 48, 2),
 ('B', 60, 1),
 ('D', 12, 1)]

Ahora calculo calculo la media (que lo ponía al inicio del ejercicio) AVG. Añado la media de cantidad de dinero prestada.

In [ ]:
%%sql
SELECT status, count(*) as total, avg (amount)
FROM LOAN
GROUP BY status
ORDER BY total DESC

 * sqlite:///data_berka.db
Done.

[('C', 403, 171410.3523573201),
 ('A', 203, 91641.45812807881),
 ('D', 45, 249284.53333333333),
 ('B', 31, 140720.90322580645)]

Ahora que dure más de 24 meses.

In [ ]:
%%sql
SELECT status, count(*) as total, avg (amount)
FROM LOAN
WHERE duration >= 24
GROUP BY status
ORDER BY total DESC

 * sqlite:///data_berka.db
Done.

[('C', 376, 180343.1489361702),
 ('A', 110, 122425.2),
 ('D', 44, 254127.27272727274),
 ('B', 21, 179909.14285714287)]

Con el Having se filtran los grupos tras obtenerlos. Es decir filtra los registros agrupados que satisfagan las condiciones del HAVING.
WHERE se filtran los registros antes de agruparlos
Con el having se filtran los grupos tras obtenerlos.

In [ ]:
%%sql
SELECT status, count(*) as total, avg (amount)
FROM LOAN
WHERE duration >= 24
GROUP BY status
HAVING total > 25
ORDER BY total DESC

 * sqlite:///data_berka.db
Done.

[('C', 376, 180343.1489361702),
 ('A', 110, 122425.2),
 ('D', 44, 254127.27272727274)]

9. Por cada Región, quiero contar el número de ciudades y obtener el total del número de habitantes de la región
NO CONSIDERAR LA REGIÓN DE PRAGA. 
POR FAVOR, CONFIRMADME SI ES CORRECTO,

In [ ]:
%%sql
SELECT A3, count(A9) as total, SUM(A4)  
FROM DISTRICT
WHERE A3 is not ("Prague") 
GROUP BY A3
ORDER BY total DESC
limit 8

 * sqlite:///data_berka.db
Done.

[('south Moravia', 14, 2054989),
 ('central Bohemia', 12, 1105234),
 ('east Bohemia', 11, 1234781),
 ('north Moravia', 11, 1970302),
 ('north Bohemia', 10, 1178977),
 ('west Bohemia', 10, 859306),
 ('south Bohemia', 8, 700595)]

10. Contar ordenes permanentes (domiciliaciones) por banco y tipo de transacción

In [ ]:
%%sql
SELECT *
FROM PERMANENT_ORDER
limit 20

 * sqlite:///data_berka.db
Done.

[(29401, 1, 'YZ', '87144583', 2452, 'SIPO'),
 (29402, 2, 'ST', '89597016', 3372.7, 'UVER'),
 (29403, 2, 'QR', '13943797', 7266, 'SIPO'),
 (29404, 3, 'WX', '83084338', 1135, 'SIPO'),
 (29405, 3, 'CD', '24485939', 327, ' '),
 (29406, 3, 'AB', '59972357', 3539, 'POJISTNE'),
 (29407, 4, 'UV', '26693541', 2078, 'SIPO'),
 (29408, 4, 'UV', '5848086', 1285, 'SIPO'),
 (29409, 5, 'GH', '37390208', 2668, 'SIPO'),
 (29410, 6, 'AB', '44486999', 3954, 'SIPO'),
 (29411, 7, 'IJ', '34452903', 4880, 'SIPO'),
 (29412, 8, 'UV', '12510681', 2612, 'SIPO'),
 (29413, 8, 'IJ', '93210345', 6712, ' '),
 (29414, 10, 'UV', '18686104', 7033, 'SIPO'),
 (29415, 10, 'QR', '93182509', 1344, 'LEASING'),
 (29416, 11, 'ST', '38470870', 2132, 'SIPO'),
 (29417, 12, 'CD', '23010808', 297, 'SIPO'),
 (29418, 12, 'KL', '63607060', 3295, 'SIPO'),
 (29419, 13, 'EF', '35443323', 2444, 'SIPO'),
 (29420, 14, 'WX', '11793136', 3629, 'SIPO')]

In [ ]:
%%sql
SELECT count(order_id), bank_to, k_symbol  
FROM PERMANENT_ORDER
GROUP BY bank_to, k_symbol
limit 8

 * sqlite:///data_berka.db
Done.

[(113, 'AB', ' '),
 (24, 'AB', 'LEASING'),
 (46, 'AB', 'POJISTNE'),
 (278, 'AB', 'SIPO'),
 (58, 'AB', 'UVER'),
 (94, 'CD', ' '),
 (23, 'CD', 'LEASING'),
 (28, 'CD', 'POJISTNE')]

# JOIN

Con join realizo el producto cartesiano de dos relaciones (tablas).
A su vez podemos realizar consultas de varias tablas y recibe el producto cartesiano de todas las posibles combinaciones entre las tuplas de las relaciones involucradas pero debo de decirle que algunas columnas son iguales para que no las duplique.

11. ¿Cuántas cuentas de frecuencia mensual tienen un un préstamo activo?

In [ ]:
%%sql
SELECT *
FROM LOAN
limit 5

 * sqlite:///data_berka.db
Done.

[(5314, 1787, 930705, 96396, 12, 8033, 'B'),
 (5316, 1801, 930711, 165960, 36, 4610, 'A'),
 (6863, 9188, 930728, 127080, 60, 2118, 'A'),
 (5325, 1843, 930803, 105804, 36, 2939, 'A'),
 (7240, 11013, 930906, 274740, 60, 4579, 'A')]

En este caso la columna account la tengo tanto en la tabla LOAN (préstamos) como en la tabla ACCOUNT (cuentas), por lo que se lo explico igualándolos, reclasifico el nombre de las tablas con l y a. Le digo que la frecuencia sea mensual (podrá ser semanal weekly o diario daily)

In [ ]:
%%sql
SELECT count(*) 
FROM LOAN l, ACCOUNT a
WHERE l.account_id = a.account_id
and frequency = "monthly"
and status in ("C", "D")

 * sqlite:///data_berka.db
Done.

[(369,)]

Ejemplos de varios join

In [ ]:
%%sql
SELECT loan_id, A4, A9, A10, A11, c.birth_number, l.date loan_date, amount, duration, payments, frequency, a.date acc_date, status
FROM LOAN l, ACCOUNT a, DISTRICT d, DISPOSITION dp, CLIENT c
WHERE l.account_id = a.account_id -- join account y loan
AND a.district_id = d.A1 -- join district y account
AND dp.account_id = a.account_id -- join disposition y account
AND dp.client_id = c.client_id -- join disposition y client
AND status in ("A", "B")
ORDER BY amount DESC, a.date DESC
LIMIT 10

 * sqlite:///data_berka.db
Done.

[(6228, 77963, 4, 51.5, 8546, '406202', 931201, 464520, 60, 7742, 'weekly', 930319, 'B'),
 (6038, 1204953, 1, 100.0, 12541, '406015', 940810, 323472, 48, 6739, 'monthly', 930621, 'A'),
 (5918, 67298, 7, 43.8, 8561, '640313', 940604, 300204, 36, 8339, 'monthly', 930605, 'A'),
 (5395, 106054, 6, 63.1, 8110, '666210', 940730, 299088, 36, 8308, 'monthly', 930606, 'B'),
 (6526, 86513, 5, 50.5, 8288, '586026', 950103, 288468, 36, 8013, 'monthly', 940829, 'A'),
 (6232, 124605, 8, 46.0, 8772, '490518', 940708, 276660, 36, 7685, 'monthly', 930828, 'B'),
 (7240, 1204953, 1, 100.0, 12541, '780907', 930906, 274740, 60, 4579, 'weekly', 930214, 'A'),
 (6244, 1204953, 1, 100.0, 12541, '371104', 950108, 270648, 36, 7518, 'weekly', 940307, 'B'),
 (6725, 51428, 4, 52.7, 8402, '485828', 950623, 265320, 36, 7370, 'monthly', 930918, 'A'),
 (6725, 51428, 4, 52.7, 8402, '501204', 950623, 265320, 36, 7370, 'monthly', 930918, 'A')]

11. Domiciliaciones (*órdenes*) semanales para alquiler (*leasing*) en cuentas de Praga

 - Ordenes permanentes de alquiler (*leasing*) y semanales (*weekly*). Es decir domiciliaciones en cuentas de actualización semanal de alquiler en cuentas de Praga.

 
Alquiler en k_symbol de Relation_permanent el LEASING;
Prague de DISTRICT en región que es A3.
amount de PERMANENT ORDER como cantidad debida;
order_id de PERMANET ORDER como domiciliación.
account_id que está en account y permanent order debido al identificador de la cuenta a la que va el cargo.

In [ ]:
%%sql
SELECT *
FROM PERMANENT_ORDER, ACCOUNT, district
limit 5

 * sqlite:///data_berka.db
Done.

[(29401, 1, 'YZ', '87144583', 2452, 'SIPO', 576, 55, 'monthly', 930101, 1, 'Hl.m. Praha', 'Prague', 1204953, 0, 0, 0, 1, 1, 100.0, 12541, 0.29, 0.43, 167, 85677, 99107),
 (29401, 1, 'YZ', '87144583', 2452, 'SIPO', 576, 55, 'monthly', 930101, 2, 'Benesov', 'central Bohemia', 88884, 80, 26, 6, 2, 5, 46.7, 8507, 1.67, 1.85, 132, 2159, 2674),
 (29401, 1, 'YZ', '87144583', 2452, 'SIPO', 576, 55, 'monthly', 930101, 3, 'Beroun', 'central Bohemia', 75232, 55, 26, 4, 1, 5, 41.7, 8980, 1.95, 2.21, 111, 2824, 2813),
 (29401, 1, 'YZ', '87144583', 2452, 'SIPO', 576, 55, 'monthly', 930101, 4, 'Kladno', 'central Bohemia', 149893, 63, 29, 6, 2, 6, 67.4, 9753, 4.64, 5.05, 109, 5244, 5892),
 (29401, 1, 'YZ', '87144583', 2452, 'SIPO', 576, 55, 'monthly', 930101, 5, 'Kolin', 'central Bohemia', 95616, 65, 30, 4, 1, 6, 51.4, 9307, 3.85, 4.43, 118, 2616, 3040)]

In [ ]:
%%sql
SELECT order_id, p.account_id, amount
FROM PERMANENT_ORDER p, ACCOUNT a, DISTRICT d
WHERE p.account_id = a.account_id
and a.district_id = d.A1
and k_symbol = "LEASING"
and frequency = "weekly"
and A3 = "Prague"

 * sqlite:///data_berka.db
Done.

[(29514, 72, 2923),
 (30250, 573, 2249),
 (30944, 1056, 2531.7),
 (34056, 3141, 1087),
 (35237, 3959, 1680.6),
 (40429, 7465, 1060.6)]


Igual pero ampliando a un relación con cuentas que tienen región Praga

In [ ]:
%%sql
SELECT order_id, k_symbol, bank_to, a.account_id, a.frequency, d.A3
FROM PERMANENT_ORDER p, ACCOUNT a, DISTRICT d
WHERE p.account_id = a.account_id
and a.district_id = d.A1
and k_symbol = "LEASING"
and frequency = "weekly"
and A3 = "Prague"

 * sqlite:///data_berka.db
Done.

[(29514, 'LEASING', 'OP', 72, 'weekly', 'Prague'),
 (30250, 'LEASING', 'CD', 573, 'weekly', 'Prague'),
 (30944, 'LEASING', 'IJ', 1056, 'weekly', 'Prague'),
 (34056, 'LEASING', 'OP', 3141, 'weekly', 'Prague'),
 (35237, 'LEASING', 'AB', 3959, 'weekly', 'Prague'),
 (40429, 'LEASING', 'ST', 7465, 'weekly', 'Prague')]

El profesor añade en el selecta la columna A2 pero como dice región yo solo dejo A3 que es la columna que se refiere a la región y así se ve mas limpia la tabla.

Pruebo A2 a ver que tiene.

In [ ]:
%%sql
SELECT A2
FROM district
GROUP BY A2

12. Transacciones relacionadas con pensiones (DUCHOD) en Plzen desde el banco MN

(limitar a 10)

Usamos like (cadena de caracteres)

In [ ]:
%%sql
SELECT trans_id, a.account_id, a.frequency, t.type, k_symbol, bank
FROM TRANS t, ACCOUNT a, DISTRICT d
WHERE t.account_id = a.account_id and a.district_id = d.A1
  and k_symbol = "DUCHOD" and bank = "MN" and d.A2 like "Plzen%"   
LIMIT 10

 * sqlite:///data_berka.db
Done.

[(47969, 161, 'monthly', 'PRIJEM', 'DUCHOD', 'MN'),
 (47970, 161, 'monthly', 'PRIJEM', 'DUCHOD', 'MN'),
 (47971, 161, 'monthly', 'PRIJEM', 'DUCHOD', 'MN'),
 (47972, 161, 'monthly', 'PRIJEM', 'DUCHOD', 'MN'),
 (47973, 161, 'monthly', 'PRIJEM', 'DUCHOD', 'MN'),
 (47974, 161, 'monthly', 'PRIJEM', 'DUCHOD', 'MN'),
 (47975, 161, 'monthly', 'PRIJEM', 'DUCHOD', 'MN'),
 (47976, 161, 'monthly', 'PRIJEM', 'DUCHOD', 'MN'),
 (47977, 161, 'monthly', 'PRIJEM', 'DUCHOD', 'MN'),
 (1098524, 3753, 'monthly', 'PRIJEM', 'DUCHOD', 'MN')]

# Subconsultas

13. Prestamos cuya cantidad es superior a la media de los clientes de Praga

- Cantidad media prestada a los cuentas de Praga

In [ ]:
%%sql
SELECT avg(l.amount)
FROM LOAN l, ACCOUNT a, DISTRICT D
WHERE l.account_id = a.account_id and a.district_id = d.A1 
and d.A3 = "Prague"

 * sqlite:///data_berka.db
Done.

[(153957.2857142857,)]

- Consultar los préstamos superiores a esa cantidad

In [ ]:

%%sql
SELECT * 
FROM LOAN
WHERE amount > (SELECT avg(l.amount)
FROM LOAN l, ACCOUNT a, DISTRICT D
WHERE l.account_id = a.account_id and a.district_id = d.A1 
and d.A3 = "Prague")
ORDER BY amount
LIMIT 10

 * sqlite:///data_berka.db
Done.

[(7235, 10973, 931013, 154416, 48, 3217, 'A'),
 (7189, 10728, 960321, 154656, 48, 3222, 'C'),
 (5591, 3021, 961204, 155616, 48, 3242, 'C'),
 (6818, 9030, 961212, 155616, 48, 3242, 'C'),
 (6471, 7184, 960804, 155640, 24, 6485, 'A'),
 (7279, 11244, 971211, 155760, 24, 6490, 'C'),
 (6667, 8127, 960715, 155880, 24, 6495, 'A'),
 (5124, 785, 980212, 156096, 36, 4336, 'C'),
 (5527, 2728, 980615, 156420, 60, 2607, 'C'),
 (5453, 2361, 950401, 156672, 36, 4352, 'A')]

# Repaso de Join/Group By

## Objetivo 2.1

14 . Clientes de Praga con préstamos según su estado

- ¿Cuántos clientes hay en Praga? 663

In [ ]:
%%sql
SELECT count(*) 
FROM CLIENT, DISTRICT 
WHERE district_id = A1
and A3 in ("Prague")

 * sqlite:///data_berka.db
Done.

[(663,)]

- ¿Cuántas cuentas tienen asociados clientes en Praga?

In [ ]:
%%sql
SELECT * 
FROM ACCOUNT
LIMIT 10

 * sqlite:///data_berka.db
Done.

[(576, 55, 'monthly', 930101),
 (3818, 74, 'monthly', 930101),
 (704, 55, 'monthly', 930101),
 (2378, 16, 'monthly', 930101),
 (2632, 24, 'monthly', 930102),
 (1972, 77, 'monthly', 930102),
 (1539, 1, 'after_tr', 930103),
 (793, 47, 'monthly', 930103),
 (2484, 74, 'monthly', 930103),
 (1695, 76, 'monthly', 930103)]

In [ ]:
%%sql
SELECT count(*) 
FROM ACCOUNT, DISTRICT 
WHERE district_id = A1
and A3 in ("Prague")

- ¿cuántas de esas cuentas tienen asociados un préstamo?

In [ ]:
%%sql
SELECT * 
FROM LOAN 
LIMIT 5

In [ ]:
%%sql
SELECT count(*) 
FROM ACCOUNT a, DISTRICT, LOAN l
WHERE a.district_id = A1 
and a.account_id = l.account_id 
and A3 in ("Prague")

 * sqlite:///data_berka.db
Done.

[(84,)]

- Necesito saber cuántos hay por cada estado (*status*)

In [ ]:
%%sql
SELECT status, count(*) as total
FROM ACCOUNT a, DISTRICT, LOAN l
WHERE a.district_id = A1 
and a.account_id = l.account_id 
and A3 in ("Prague")
GROUP BY status
ORDER BY total

 * sqlite:///data_berka.db
Done.

[('B', 3), ('D', 4), ('A', 34), ('C', 43)]

# Extra: Left Join

1. ¿Cuántas cuentas hay? 4500
2. ¿Cuántas cuentas hay con préstamos? (inner join) 682
3. Cuentas con los datos de los préstamos si los hay ¿?¿?¿?
4. los ordenamos por cantidad ¿?¿?¿ ORDER BY amount

In [ ]:
%%sql
SELECT count(*) 
FROM ACCOUNT

 * sqlite:///data_berka.db
Done.

[(4500,)]

In [ ]:
%%sql
SELECT count(*) 
FROM ACCOUNT a, LOAN l
WHERE a.account_id = l.account_id

 * sqlite:///data_berka.db
Done.

[(682,)]

In [ ]:
%%sql 
SELECT a.account_id, a.date, l.amount, l.status, l.payments, l.duration
FROM ACCOUNT a INNER OUTER JOIN LOAN l ON a.account_id = l.account_id
ORDER BY amount DESC

 * sqlite:///data_berka.db
(sqlite3.OperationalError) unknown or unsupported join type: INNER OUTER
[SQL: SELECT a.account_id, a.date, l.amount, l.status, l.payments, l.duration
FROM ACCOUNT a INNER OUTER JOIN LOAN l ON a.account_id = l.account_id
ORDER BY amount DESC]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

# DataSets

---

Dataset sobre las transacciones con Vyskov, extrayendo los años de las diferentes fechas.

In [ ]:
%%sql dataset << SELECT substr(a.date,0,3) acc_year, substr(t.date, 0, 3) year,amount, balance, k_symbol
FROM ACCOUNT a, TRANS t, DISTRICT d
WHERE a.district_id = d.A1 and d.A2 = "Vyskov"
AND a.account_id = t.account_id

 * sqlite:///data_berka.db
Done.
Returning data to local variable dataset

In [ ]:
dataset.DataFrame().to_csv("dataset.csv")